# 4.5 Data Consistency Checks

Content list

>* Import Libraries
>* Import Data
>* Consistency checks for Products
>* Consistency checks for Orders

## Import Libaries

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

## Import Data

In [2]:
#folder path
path = r'C:\Users\kaydo\OneDrive\Desktop\Python\Data\OG Data'

In [6]:
#import products.csv
df_prods = pd.read_csv(r'C:\Users\kaydo\OneDrive\Desktop\Python\Data\OG Data\products.csv')

In [4]:
#import orders_wrangled.csv
df_ords= pd.read_csv(r'C:\Users\kaydo\OneDrive\Desktop\Python\Data\OG Data\orders_wrangled.csv')

## Consistency Check for Products

In [7]:
#explore data
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
df_prods.tail()

,product_id,product_name,aisle_id,department_id,prices
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [9]:
#find out columns
df_prods.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices'], dtype='object')

In [10]:
#check out datatypes
df_prods.dtypes

product_id         int64
product_name      object
aisle_id           int64
department_id      int64
prices           float64
dtype: object

## Check for mixed-type data

In [11]:
#checkiing for mixed type columns in products
for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].applymap(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col)

product_name

Product Name is the only column to have mixed-type data.

## Check for Missing values

In [12]:
#Find missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

Product name contains 16 missing items.

In [13]:
#create a subset for missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [14]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [16]:
#new dataframe w/o missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

## Check for Duplicates

In [17]:
#checking for duplicates on products.clean
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [19]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [20]:
#new dataframe w/o duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [21]:
df_prods_clean_no_dups.shape

(49672, 5)

## Descriptive Statistics

In [22]:
df_prods_clean_no_dups.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

Max value for prices is extremely high for groceries. Must dig in.

In [23]:
#Find out more about max price 99999
df_prods_clean_no_dups.loc[df_prods_clean_no_dups['prices'] == 99999]

       product_id           product_name  aisle_id  department_id   prices
33666       33664  2 % Reduced Fat  Milk        84             16  99999.0

Found one data type with incorrect pricing. Further analysis should be performed to understand if any other items were affected.

In [24]:
#Dig deeper on incorrect pricing
df_prods_clean_no_dups[df_prods_clean_no_dups['prices']>50.0]

,product_id,product_name,aisle_id,department_id,prices
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0
33666,33664,2 % Reduced Fat Milk,84,16,99999.0

Found second data type with incorrect pricing. Both items need to be updated.

In [25]:
#Update incorrect prices
df_prods_clean_no_dups = df_prods_clean_no_dups.replace ({'prices':{99999.0: 9.99, 14900.0: 1.49}})

In [26]:
#check price on cottage cheese
df_prods_clean_no_dups[df_prods_clean_no_dups["product_id"]==21553]

,product_id,product_name,aisle_id,department_id,prices
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,1.49

In [27]:
#check milk price
df_prods_clean_no_dups[df_prods_clean_no_dups["product_id"]==33664]

       product_id           product_name  aisle_id  department_id  prices
33666       33664  2 % Reduced Fat  Milk        84             16    9.99

In [29]:
## Update Datatype (Product_name has mixed type)
df_prods_clean_no_dups['product_name']= df_prods_clean_no_dups['product_name'].astype('str')

## Consistency Check for Orders

In [30]:
#explore data
df_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,Order_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0

In [31]:
df_ords.tail()

,Unnamed: 0,order_id,user_id,eval_set,order_number,Order_day_of_week,order_hour_of_day,days_since_prior_order
3421078,3421078,2266710,206209,prior,10,5,18,29.0
3421079,3421079,1854736,206209,prior,11,4,10,30.0
3421080,3421080,626363,206209,prior,12,1,12,18.0
3421081,3421081,2977660,206209,prior,13,1,12,7.0
3421082,3421082,272231,206209,train,14,6,14,30.0

There seems to be an unnamed column that we can drop

In [33]:
#Drop unnamed column
df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [34]:
#Review updated columns
df_ords.columns

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'Order_day_of_week',
       'order_hour_of_day', 'days_since_prior_order'],
      dtype='object')

In [35]:
#Check data types
df_ords.dtypes

order_id                    int64
user_id                     int64
eval_set                   object
order_number                int64
Order_day_of_week           int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

## Check for Mixed-Type Data

In [36]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

No mixed type data was found with df_ords

## Check for Missing Data

In [37]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
Order_day_of_week              0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [40]:
#Create a subset to show missing values
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [41]:
df_ords_nan

,order_id,user_id,eval_set,order_number,Order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

After reviewing the missing data in days since prior order we can actually ignore this because it is NOT missing data. There just isn't data because the customer only ordered once therefore there wouldn't be an input in teh days since prior order. I am choosing to do nothing.

## Check for Duplicates

In [42]:
#check for dups
df_ords_dups = df_ords[df_ords.duplicated()]

In [43]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, Order_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

No duplicate values have been found

## Descriptive Statistics

In [44]:
df_ords.describe()

,order_id,user_id,order_number,Order_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Descriptive statistics seem to be normal.

## Export Dataframes

In [45]:
#export df_prods_clean_no_dups
df_prods_clean_no_dups.to_csv(os.path.join(path,'products_checked.csv'))

In [46]:
#export df_ords
df_ords.to_csv(os.path.join(path,'orders_checked.csv'), index = False)